In [2]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.5.3'

In [3]:
None, np.nan  # zmienna przecinkowa - pusta

(None, nan)

In [4]:
s = pd.Series([1, 2, 3, np.nan, 6, 8])  # Utworzyliśmy listę
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
type(s)

pandas.core.series.Series

In [6]:
dates = pd.date_range('20130101', periods=6, freq='D')
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [8]:
df = pd.DataFrame({'A' : [1, 2, 3],
                  'B' : [1, 2, 3]})
# DataFrame  - stabeloryzwoane dane
df

   A  B
0  1  1
1  2  2
2  3  3

In [9]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df = pd.DataFrame(np.random.randn(6, 4),
                  index=dates,
                columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.155837 -1.746981 -0.115242 -1.517666
2013-01-02 -0.066605 -0.511202  0.308774 -0.926651
2013-01-03  1.503961  0.283074 -0.129393 -0.588677
2013-01-04  0.722715 -2.482809 -0.156442 -1.382740
2013-01-05 -1.453995  0.482740 -1.573584  2.743211
2013-01-06 -2.737024  0.144129  0.083443 -2.460217

In [29]:
type(np.random.randn(6,4))

numpy.ndarray

In [12]:
df2 = pd.DataFrame({
                    'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo',
                    'G' : [False, True,True,False]
                   })
df2

     A          B    C  D      E    F      G
0  1.0 2013-01-02  1.0  3   test  foo  False
1  1.0 2013-01-02  1.0  3  train  foo   True
2  1.0 2013-01-02  1.0  3   test  foo   True
3  1.0 2013-01-02  1.0  3  train  foo  False

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
 6   G       4 non-null      bool
dtypes: bool(1), category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 292.0+ bytes

Zestaw wstawionych wartości definiuje typ kolumny. Np wstawiamy listę z wartościami bool i typ kolumny to bool. Najważniejsze da nas są wartości w dataframe. Wstawienie jednego stringa do kolumny z integerami zmiania typ całej kolumny np. na object (obiekt).

In [15]:
dane_sprzedaz_df = pd.read_csv('data/dane_sprzedaz.csv', sep=',', encoding='utf-8')
dane_sprzedaz_df

     DZIEN_DATA  SKL_ID  TOW_ID  SPRZ_NETTO  ZYSK_PROCENT ZYSK_WART
0    01.05.2022       1       1       416.0             9     37,44
1    02.05.2022       1       1       454.0             2      9,08
2    03.05.2022       1       1       392.0            13     50,96
3    04.05.2022       1       1       498.0             9     44,82
4    05.05.2022       1       1       341.0            15     51,15
..          ...     ...     ...         ...           ...       ...
130  11.05.2022       3       3       374.0             7     26,18
131  12.05.2022       3       3       390.0             4      15,6
132  13.05.2022       3       3       485.0            10      48,5
133  14.05.2022       3       3       479.0             3     14,37
134  15.05.2022       3       3       366.0            13     47,58

[135 rows x 6 columns]

In [10]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.155837 -1.746981 -0.115242 -1.517666
2013-01-02 -0.066605 -0.511202  0.308774 -0.926651
2013-01-03  1.503961  0.283074 -0.129393 -0.588677

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.722715 -2.482809 -0.156442 -1.382740
2013-01-05 -1.453995  0.482740 -1.573584  2.743211
2013-01-06 -2.737024  0.144129  0.083443 -2.460217

In [13]:
df.values

array([[-0.15583678, -1.74698141, -0.11524235, -1.51766588],
       [-0.06660504, -0.51120214,  0.30877438, -0.92665075],
       [ 1.50396074,  0.2830738 , -0.12939268, -0.58867713],
       [ 0.72271487, -2.4828091 , -0.15644233, -1.38274039],
       [-1.45399516,  0.48274023, -1.57358404,  2.74321133],
       [-2.7370239 ,  0.14412897,  0.08344344, -2.46021731]])

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')